package hw22Task1;

/**
 * @author "Timohin Igor"
 *
 * На базе сервлетов сделать приложение которое позволяет работать с объектом мобильные телефоны (добавлять/удалять/редактиовать)
 *
 * 1) Избавиться от объявлений сервлетов, фильтров и слушателей в web.xml. Использовать аннотации. В web.xml должны остаться только параметры базы и описание ошибок.
 * 3) Добавить пользователям в бд дополнительные поля: email, телефон,
 * 2) Добавить в базу данных пользователей
 * 4) Реализовать страницу с возможностью авторизации в приложении и получить доступ ко всем страницам.
 * 5) При успешной авторизации перенаправлять пользователя на искомую страницу.
 * 6) Для отображения списка объектов (пользователей/ мобильников) использовать табличный вид.
 * 7) Сделать единый шаблон для страниц.
 * 8) По возможности стараться использовать JSTL.
 *
 * P.S. при подключении ресурсов (css, js) располагать их в проекте.
 */
public class Main {
}